[
  {
    "term": "Bake",
    "definition": "To cook in an oven. Make sure to preheat the oven first!"
  },
  {
    "term": "Baking Soda",
    "definition": "A leavening agent that needs acid to create a chemical reaction when baking. Recipes that use baking soda often must be baked immediately after mixing. Read more about baking soda."
  },
  {
    "term": "Baking Powder",
    "definition": "A leavening agent that contains both baking soda and the acid agent. Read more about baking powder."
  },
  {
    "term": "Beat",
    "definition": "To stir fast in a rapid circular motion. Beating can be done with a whisk, spoon or mixer."
  },
  {
    "term": "Blanch",
    "definition": "When you partially cook something in boiling water for just a few minutes then plunge it immediately into cold water to stop it from cooking. "
  },
  {
    "term": "Blend",
    "definition": "To thoroughly incorporate ingredients into each other. This is another word for beat but is often also used when ingredients are turned into liquid (i.e. in a blender)."
  },
  {
    "term": "Boil",
    "definition": "Heat liquid until bubbles rise continuously, come to the surface and break. Water boils at 212°F."
  },
  {
    "term": "Caramelize",
    "definition": "When sugars brown and get caramel in color. You caramelize sugar when you make Creme Brûlée but you can also caramelize things that have sugar on them (like when you grill pineapple)."
  },
  {
    "term": "Chop",
    "definition": "To cut into pieces. Chop usually just refers to the cutting. Sometimes other words are used in conjunction with chop: a rough chop would be larger pieces or a fine chop would be smaller pieces."
  },
  {
    "term": "Cream",
    "definition": "As a verb, creaming is when you beat butter and sugar until smooth and fluffy with a light and creamy texture."
  },
  {
    "term": "Crimp",
    "definition": "Finish the edge of a pie crust by pinching between two fingers. See more about crimping and pie crusts here."
  },
  {
    "term": "Cut In",
    "definition": "Usually done with a pastry cutter, this is a way of incorporating butter, shortening or other fat into dry ingredients. It’s a process that’s done often when making pie crust, crumbles, biscuits or scones. The mixture will be the size of dry peas once you’re done cutting in. In lieu of a pastry cutter you can use two forks or two knives to cut in ingredients."
  },
  {
    "term": "Dash",
    "definition": "Measurement that’s less than 1/8 teaspoon (but more than a pinch)"
  },
  {
    "term": "Dice",
    "definition": "Cut into small uniform square pieces, usually bite size."
  },
  {
    "term": "Drizzle",
    "definition": "Usually done with icing, glaze or melted chocolate, this is the process of dripping the icing off a fork or spoon onto your finished recipe."
  },
  {
    "term": "Dry Ingredients",
    "definition": "Ingredients that have no liquid and can be measured in dry measuring cups (i.e. flour and sugar)"
  },
  {
    "term": "Dust",
    "definition": "A light sprinkling of powdered sugar, cinnamon sugar or other spice over the top of a recipe."
  },
  {
    "term": "Fold",
    "definition": "A process of stirring that gently combines something heavy into something light so that the heavy ingredient doesn’t ruin the light one. For example, you often fold whipped cream into a thicker mixture (like peanut butter for peanut butter pie). Folding ensures the mixture will still set up at the end of the recipe."
  },
  {
    "term": "Glaze",
    "definition": "This is a light layer of icing that is more liquid in form than frosting. Glazes can be drizzled over recipes or baked goods can be dipped in glaze (i.e. glazed doughnuts)."
  },
  {
    "term": "Glossy Sheen",
    "definition": "This is what cookies get in the oven. Once the glossy sheen is gone, the cookies are done baking. Learn more about cookie doneness here."
  },
  {
    "term": "Grease",
    "definition": "To prepare your pans so they don’t stick to the food. Greasing your pans can be done with nonstick cooking spray or butter, shortening or oil."
  },
  {
    "term": "Knead",
    "definition": "Done most often when working with biscuit or yeasted dough, kneading is the process of folding, pushing and turning the dough until it becomes malleable and not sticky."
  },
  {
    "term": "Leavening",
    "definition": "An ingredient that helps your baked goods rise. See Baking Soda and Baking Powder."
  },
  {
    "term": "Lukewarm",
    "definition": "A temperature that is neither hot nor cold. Usually around 100-105°F."
  },
  {
    "term": "Mix until moistened",
    "definition": "Stir or beat just until the wet ingredients and dry ingredients are mixed together, then stop. Also called “mix just until combined”."
  },
  {
    "term": "Pinch",
    "definition": "Less than a dash, literally the amount you get when you pinch a spice or other ingredient between your thumb and forefinger."
  },
  {
    "term": "Preheat",
    "definition": "To heat the oven before baking. Always fully preheat the oven at least 15 minutes before baking."
  },
  {
    "term": "Proof",
    "definition": "To let dough rise and rest. When talking about activating some yeast, proofing means mixing yeast with hot water and allowing it to bubble and awaken."
  },
  {
    "term": "Punch",
    "definition": "In between risings of bread or other such dough you’re asked to deflate it by punching it down in between."
  },
  {
    "term": "Rolling Boil",
    "definition": "Rapidly boiling with lots of bubbles."
  },
  {
    "term": "Scant",
    "definition": "In terms of measurement, a scant cup of flour is measured just below the cup line (just less than the amount called for)."
  },
  {
    "term": "Scald",
    "definition": "To heat a mixture just below the boiling point."
  },
  {
    "term": "Simmer",
    "definition": "Just before a mixture boils, after it scalds, is when it simmers: little bubbles form around the edge of the pan."
  },
  {
    "term": "Softened",
    "definition": "When butter or cream cheese or another similar ingredient is no longer hard to the touch. Often called room temperature. Learn about how to soften butter."
  },
  {
    "term": "Soft Peaks",
    "definition": "When referring to egg whites or whipped cream, soft peaks are when the mixture is soft and rounded when the beaters are pulled away from the mixture."
  },
  {
    "term": "Stiff Peaks",
    "definition": "When referring to egg whites or whipped cream, stiff peaks are when the mixture holds its shape when the beaters are pulled away from the mixture."
  },
  {
    "term": "Stir",
    "definition": "To combine ingredients in a circular motion."
  },
  {
    "term": "Wet ingredients",
    "definition": "Liquid ingredients or ingredients that are wet (i.e. oil, water or peanut butter). Learn more about measuring wet ingredients."
  },
  {
    "term": "Whip",
    "definition": "Beating or stirring rapidly with a whisk to add air and volume into a recipe."
  },
  {
    "term": "Yield",
    "definition": "The amount of servings estimated for a recipe"
  },
  {
    "term": "Zest",
    "definition": "The colorful outside peel of citrus fruit. Also known as grated peel, you want to just use the colorful part not the white pith underneath. To grate zest, use a microplane grater or the smallest part of a box grater."
  }
]
